![tower bridge](london.jpg)

London, or as the Romans called it "Londonium"! Home to [over 8.5 million residents](https://www.ons.gov.uk/peoplepopulationandcommunity/populationandmigration/populationestimates/bulletins/populationandhouseholdestimatesenglandandwales/census2021unroundeddata#population-and-household-estimates-england-and-wales-data) who speak over [300 languages](https://web.archive.org/web/20080924084621/http://www.cilt.org.uk/faqs/langspoken.htm). While the City of London is a little over one square mile (hence its nickname "The Square Mile"), Greater London has grown to encompass 32 boroughs spanning a total area of 606 square miles! 

![underground train leaving a platform](tube.jpg)

Given the city's roads were originally designed for horse and cart, this area and population growth has required the development of an efficient public transport system! Since the year 2000, this has been through the local government body called **Transport for London**, or *TfL*, which is managed by the London Mayor's office. Their remit covers the London Underground, Overground, Docklands Light Railway (DLR), buses, trams, river services (clipper and [Emirates Airline cable car](https://en.wikipedia.org/wiki/London_cable_car)), roads, and even taxis.

The Mayor of London's office make their data available to the public [here](https://data.london.gov.uk/dataset). In this project, you will work with a slightly modified version of a dataset containing information about public transport journey volume by transport type.

In [6]:
-- most_popular_transport_types
SELECT JOURNEY_TYPE, ROUND(SUM(JOURNEYS_MILLIONS),2) AS TOTAL_JOURNEYS_MILLIONS
FROM TFL.JOURNEYS AS most_popular_transport_types
WHERE JOURNEY_TYPE IS NOT NULL 
GROUP BY JOURNEY_TYPE
ORDER BY TOTAL_JOURNEYS_MILLIONS DESC;

        JOURNEY_TYPE  TOTAL_JOURNEYS_MILLIONS
0                Bus                 24905.19
1  Underground & DLR                 15020.47
2         Overground                  1666.85
3           TfL Rail                   411.31
4               Tram                   314.69
5   Emirates Airline                    14.58

In [7]:
SELECT MONTH, YEAR, ROUND(JOURNEYS_MILLIONS, 2) AS ROUNDED_JOURNEYS_MILLIONS
FROM TFL.JOURNEYS AS emirates_airline_popularity
WHERE MONTH IS NOT NULL
AND YEAR IS NOT NULL
AND JOURNEYS_MILLIONS IS NOT NULL 
AND JOURNEY_TYPE IS NOT NULL AND JOURNEY_TYPE='Emirates Airline'
ORDER BY ROUNDED_JOURNEYS_MILLIONS DESC 
LIMIT 5;

   MONTH  YEAR  ROUNDED_JOURNEYS_MILLIONS
0      5  2012                       0.53
1      6  2012                       0.38
2      4  2012                       0.24
3      5  2013                       0.19
4      5  2015                       0.19

In [8]:
SELECT JOURNEY_TYPE, YEAR, ROUND(SUM(JOURNEYS_MILLIONS), 2) AS TOTAL_JOURNEYS_MILLIONS
FROM TFL.JOURNEYS AS least_popular_years_tube
WHERE JOURNEY_TYPE = 'Underground & DLR'
GROUP BY JOURNEY_TYPE, YEAR
ORDER BY TOTAL_JOURNEYS_MILLIONS ASC
LIMIT 5;

        JOURNEY_TYPE  YEAR  TOTAL_JOURNEYS_MILLIONS
0  Underground & DLR  2020                   310.18
1  Underground & DLR  2021                   748.45
2  Underground & DLR  2022                  1064.86
3  Underground & DLR  2010                  1096.15
4  Underground & DLR  2011                  1156.65